#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.lambda_notify_teams must be replaced
-/+ resource "aws_iam_role" "lambda_notify_teams" {
      ~ arn                   = "arn:aws:iam::521635626865:role/yama-dev-env-lambda-notify-teams" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-05-01T16:46:47Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "yama-dev-env-lambda-notify-teams" -> (known after apply)
        max_session_duration  = 3600
        name                  = "yama-dev-env-lambda-notify-teams"
      ~ path                  = "/" -> "/yama-dev-env/" # forces replacement
        tags                  = {
            "Author" = "yamaguti-dxa"
            "Name"   = "yama-dev-env-lambda-notify-teams"
        }
      ~ unique_id             = "AROAXS47H75YQJBKVVBR6" -> (known after apply)
    }

  # aws_iam_role_policy.lambda_notify_teams will be destroyed
  - resource "aws_iam_role_policy" "lambda_notify_teams" {
      - id     = "yama-dev-env-lambda-notify-teams:yama-dev-env-lambda-notify-teams" -> null
      - name   = "yama-dev-env-lambda-notify-teams" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "yama-dev-env-lambda-notify-teams" -> null
    }

  # aws_iam_role_policy_attachment.cloudwatchlogs_ro will be destroyed
  - resource "aws_iam_role_policy_attachment" "cloudwatchlogs_ro" {
      - id         = "yama-dev-env-lambda-notify-teams-20200502161416412800000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsReadOnlyAccess" -> null
      - role       = "yama-dev-env-lambda-notify-teams" -> null
    }

  # aws_iam_role_policy_attachment.notify_teams_cloudwatchlogs_ro will be created
  + resource "aws_iam_role_policy_attachment" "notify_teams_cloudwatchlogs_ro" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsReadOnlyAccess"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.notify_teams_lambda_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "notify_teams_lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.notify_teams_ssm_ro will be created
  + resource "aws_iam_role_policy_attachment" "notify_teams_ssm_ro" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.ssm_ro will be destroyed
  - resource "aws_iam_role_policy_attachment" "ssm_ro" {
      - id         = "yama-dev-env-lambda-notify-teams-20200502134842389800000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMReadOnlyAccess" -> null
      - role       = "yama-dev-env-lambda-notify-teams" -> null
    }

  # aws_lambda_function.notify_teams will be updated in-place
  ~ resource "aws_lambda_function" "notify_teams" {
        arn                            = "arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-notify-teams"
        filename                       = "lambda/artifacts/notify_teams.zip"
        function_name                  = "yama-dev-env-notify-teams"
        handler                        = "main.lambda_handler"
        id                             = "yama-dev-env-notify-teams"
        invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-notify-teams/invocations"
        last_modified                  = "2020-05-02T16:42:17.455+0000"
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ap-northeast-1:521635626865:function:yama-dev-env-notify-teams:$LATEST"
        reserved_concurrent_executions = -1
      ~ role                           = "arn:aws:iam::521635626865:role/yama-dev-env-lambda-notify-teams" -> (known after apply)
        runtime                        = "python3.6"
        source_code_hash               = "i8ythtOTtVmI7ttYhO0zIuW3aSiysajwBBHfUygLGP8="
        source_code_size               = 1306
        tags                           = {
            "Author" = "yamaguti-dxa"
            "Name"   = "yama-dev-env-notify-teams"
        }
        timeout                        = 30
        version                        = "$LATEST"

        environment {
            variables = {
                "TEAMS_WEBHOOK_URL_SSM_NAME" = "yama-dev-env-teams-webhook-url"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```

</details>

*Workflow: `dev-env.terraform.ci-pr`, Action: `hashicorpterraform-github-actions3`, Working Directory: `./dev-env/terraform`, Workspace: `default`*
